{"GetJsonResult":{"EntityName":"si_event","FailureReason":"","Counter":1,"MoreRecords":false,"OptionSetName":null,"Success":true,"OptionSetsClean":null,"OptionSets":null,"Entities":[{"Activity.ID":"5e91e211-cd0a-ea11-a811-000d3a86d545","Activity.ActivityCode":"CJ201","Activity.ActivityTitle":"Data and computer systems in GCSE computer science","Activity.CurrencyID":"b07a2531-ab4d-e911-a8a8-002248005a98","Activity.InstanceCode":"E01","Activity.StartDate":"14\/01\/2020 09:00:00","Activity.EndDate":"25\/02\/2020 16:00:00","Activity.ManuallyAssignedPathway":"False","Activity.ITKCPDTypeID":"ab8ca962-c197-eb11-b1ac-0022481a823f","Activity.Status":"157430001","Activity.Summary":"<p>&nbsp;<\/p>\u000a<p><strong>This course is delivered as part of the National Centre for Computing Education, and forms part of the <a href=\"https:\/\/www.stem.org.uk\/national-centre-for-computing-education\/cs-accelerator-programme\" target=\"_blank\" rel=\"noopener\">Computer Science Accelerator programme<\/a>.<\/strong><\/p>\u000a<p>Computer programs are written in a language that humans understand, but what about the computer itself? Every piece of software, and the instructions and data it contains, is made up of 1&rsquo;s and 0&rsquo;s, pushed around the parts of a computer system.<\/p>\u000a<p>This course opens the box, looking at the components of a computer, what they do and how they work together in computer systems. You&rsquo;ll learn about the processor that sits at the centre, as well as memory, storage and the other key pieces of hardware.<\/p>\u000a<p>Mapped closely to the specifications of GCSE computer science, the course will provide you with deepened knowledge and confidence to equip your students with for their exams.<\/p>\u000a<p>Bursaries exist to support you through 40 hours of CPD to complete the CS Accelerator programme. If you don&rsquo;t complete the programme, we reserve the right to reclaim any bursaries paid.<\/p>","Activity.Confirmed":"True","Activity.SubDelivererID":"367a673f-f909-ea11-a811-000d3a86d716","Activity.SubDeliverer":"Kings Priory School - 139658  ","Activity.Deliverer":"157430003","Activity.CourseLeaders":"","Activity.HowLongCourse":"","Activity.TopicsCovered":"","Activity.WhoIsFor":"","Activity.Pathway":"","Activity.HowYouWillLearn":"","Activity.FacilitatorContactId":"","Activity.FacilitatorContactName":"","Activity.FacilitatorContactEmail":"","Activity.AdditionalSubject":"100000013;100000015;157430003","Venueaddress.OrganisationID":"2aed4e20-f609-ea11-a811-000d3a86d545","Venueaddress.PostCode":"NE30 3RZ","Venueaddress.City":"Cullercoats","Venueaddress.Line1":"North Tyneside CLC","Venueaddress.Line2":"Hartingdon Road","Venueaddress.Line3":"","Venueaddress.Name":"North Tyneside CLC","Template.Workstream":"CS Accelerator","Template.ID":"7159562d-4b1a-44f3-b4d7-3e677b9898f2","Template.Market":"157430005","Template.Programme":"NCCE","Template.Title":"DO NOT USE Data and computer systems in GCSE computer science","Template.Subject":"157430003","Template.Duration":2,"Template.DurationUnit":"157430000","Template.TemplateStatus":"157430001","Template.RemoteDeliveredCPD":false,"Template.CourseLeaders":"","Template.HowLongCourse":"<p>This course is a split across two-days each involving 5 hours of learning. There is a mandatory gap task of 2-4 hours duration.&nbsp;&nbsp;<\/p>","Template.TopicsCovered":"<ul>\u000a<li><strong>01 | Hardware, Input, Process &amp; Output Model<\/strong> &ndash; explore the roles and characteristics of different hardware components found inside the computer and how these work together.<\/li>\u000a<li><strong>02 | RAM, ROM and Virtual Memory<\/strong> &ndash; learn how different types of memory are used by a computer system including the need for, and characteristics of, virtual memory.<\/li>\u000a<li><strong>03 | Storage<\/strong> &ndash; Explore how data is stored using different storage methods, including optical, magnetic and solid state storage. Learn how to calculate different file sizes and how to suggest suitable storage mediums based upon user requirements.<\/li>\u000a<li><strong>04 | Program and instruction sets<\/strong> &ndash; Learn how low and high level languages are used by computers and humans. Explore the characteristics of translators including assemblers, compilers and interpreters.<\/li>\u000a<li><strong>05 | Inside the CPU<\/strong> &ndash; Understanding the role of the CPU is important to understanding how a computer functions. This session will explore the different components found inside the CPU and how these link with the fetch, decode, execute cycle.<\/li>\u000a<li><strong>06 | CPU Performance <\/strong>&ndash; The CPU plays a key part of the performance of a computer, this session will explore how the cache size, clock speed and amount of cores can impact the performance of a CPU.<\/li>\u000a<\/ul>","Template.WhoIsFor":"<p>This course is for secondary teachers of GCSE Computer Science and forms part of the <a href=\"https:\/\/teachcomputing.org\/cs-accelerator\">Computer Science Accelerator<\/a> programme, a 40 hour+ programme of subject knowledge enhancement. This programme is suitable for existing computer science teachers wanting to upskill their knowledge of algorithms or those converting from other subjects to teach GCSE Computer Science. Generous bursaries are available to help you access the CPD you need.<\/p>","Template.Pathway":"","Template.HowYouWillLearn":"<p>Active learning in groups including direct instruction, hands-on activities and challenge-based learning. Examination practice with guidance linked to the specific requirements of the main awarding bodies. The course will model teaching approaches that can be taken back to the classroom.<\/p>","Template.AdditionalSubject":"100000013;100000015;157430003"}]}}